---
kind: method
id: M:Autodesk.Revit.DB.FamilyManager.IsUserAssignableParameterGroup(Autodesk.Revit.DB.ForgeTypeId)
source: html/414a0359-4e22-26ed-c01c-f52a81dccf06.htm
---
# Autodesk.Revit.DB.FamilyManager.IsUserAssignableParameterGroup Method

Checks if the given parameter group can be assigned to new parameters.

## Syntax (C#)
```csharp
public bool IsUserAssignableParameterGroup(
	ForgeTypeId groupTypeId
)
```

## Parameters
- **groupTypeId** (`Autodesk.Revit.DB.ForgeTypeId`)

## Returns
True if the parameter group can be assigned to new parameters, false otherwise.